---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrTrimTop
source: html/2f7e04be-3900-7be2-ebf5-a028b6d574f8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrTrimTop Property

"Trim Stringers at Top"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrTrimTop { get; }
```